"""
Напишите программу для печати всех различных значений в словаре.

Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
{"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
":" S007 "}]

Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

*Примечание: Список словарей задан изначально. Пользователь его не вводит*
"""

list = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": "S005"}, {" V ":"S009"}, {" VIII ":"S007"}]
set = set()

for i in list: #
    for j in i.keys(): #
        set.add(i[j])

print(set)